      EXEC SQL
        CLOSE DB1
      END-EXEC

      EXEC SQL
        CLOSE DB2
      end-exec

      exec sql
        CLOSE DB3
      END-EXEC

      exec sql
        CLOSE DB4
      end-exec