       IDENTIFICATION DIVISION.
       PROGRAM-ID.    IFTest5.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           IF A > 0
              AND B = 10
             DISPLAY 'IF CONTENT' 
           END-IF