       IDENTIFICATION DIVISION.
       PROGRAM-ID.    IFTest4.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           IF A > 0
              AND B = 10 AND
              C > 10
             DISPLAY 'IF CONTENT' 
           END-IF