       IDENTIFICATION DIVISION.
       PROGRAM-ID.    IFTest2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           IF A > 0
             DISPLAY 'IF CONTENT' 
           END-IF