       IDENTIFICATION DIVISION.
       PROGRAM-ID.    IFTest3.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           IF A > 0
              and B > 0
             DISPLAY 'IF CONTENT' 
           END-IF