       IDENTIFICATION DIVISION.
       PROGRAM-ID.    IFTest11.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           IF A > 0
             DISPLAY 'IF CONTENT '
           ELSE
             DISPLAY 'ELSE CONTENT ' 
           END-IF