           IF A > 0
             DISPLAY 'ELSE CONTENT' 
           ELSE
             IF B > 0
                DISPLAY 'INNER IF CONTENT'
             END-IF
           END-IF