           IF A > 0
            DISPLAY 'IF 1'
           END-IF
           IF B > 0
            DISPLAY 'IF 1'
           END-IF
           IF C > 0
            DISPLAY 'IF 1'
           END-IF