       IDENTIFICATION DIVISION.
       PROGRAM-ID.    DotStringTest1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           IF A
             DISPLAY '------------------------------'
             DISPLAY 'ENREG. NO: '
             DISPLAY 'ERREUR DB2 '
             DISPLAY '------------------------------'
           END-IF