01 CONSTANTES-PAC.
         05 FILLER             PIC  X(87)        VALUE 
           'This is a string with code: IF ITE00R > 0  PROJ27/11/2015
      -    '3.5 V0501/06/201020/11/2008'
            .
           IF A > 0
             DISPLAY 'IF CONTENT '
           ELSE
             DISPLAY 'ELSE CONTENT ' 
           END-IF