       IDENTIFICATION DIVISION.
       PROGRAM-ID.    STRTest1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           IF A > 0
             DISPLAY 'This is a string with code: IF A > 0'
           ELSE
             DISPLAY 'ELSE CONTENT ' 
           END-IF
