       IDENTIFICATION DIVISION.
       PROGRAM-ID.    STRTest2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           IF A > 0
             DISPLAY 'This is a string with code: IF ITE00R > 0  
      -    'PROJ27/11/2015 3.5 V0501/06/201020/11/2008'
           ELSE
             DISPLAY 'ELSE CONTENT ' 
           END-IF