       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      Example1.
       PROCEDURE DIVISION.
           IF A < 0 AND A < 10
               DISPLAY "--- End ---"
           END-IF

           IF B < 10
               DISPLAY "--- End ---"
           END-IF



