       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      Example1.
       PROCEDURE DIVISION.
           IF A = 0 
               DISPLAY "--- End ---"
           END-IF


